//*************************************************************************************************
//ИМПОРТЫ
//*************************************************************************************************
import '/pages/index.css'; // импорт главного файла стилей

import {openPopup, closePopup, handleFormSubmitProfile, openProfilePopup, formProfile} from './modal.js';
import {handleFormSubmitPlace, formPlace, popupPlace} from './сard.js';
import {enableValidation} from "./validate";

///////////////////////////////////////////////////////////////////////////////////////////////////

//*************************************************************************************************
//КОНСТАНТЫ
//*************************************************************************************************
const closeButtons = document.querySelectorAll('.popup__button-close');
const openPopupProfileButton = document.querySelector('.profile__button-edit');
const openPopupPlaceButton = document.querySelector('.profile__button-add');
export const Words = {
  formSelector: '.form',
  inputSelector: '.form__input',
  submitButtonSelector: '.form__button-submit',
  inactiveButtonClass: 'form__submit_inactive',
  inputErrorClass: 'form__input_type_error',
  errorClass: 'form__input-error_active'
};
///////////////////////////////////////////////////////////////////////////////////////////////////

//*************************************************************************************************
//СЛУШАТЕЛЬ ОТКРЫТИЯ ПОПАПА ПРОФАЙЛ
//*************************************************************************************************
openPopupProfileButton.addEventListener('click', openProfilePopup);
///////////////////////////////////////////////////////////////////////////////////////////////////

//*************************************************************************************************
//СЛУШАТЕЛЬ ЗАКРЫТИЯ ПОПАПА МЕСТО
//*************************************************************************************************
openPopupPlaceButton.addEventListener('click', () => openPopup(popupPlace));
///////////////////////////////////////////////////////////////////////////////////////////////////

//*************************************************************************************************
//СЛУШАТЕЛЬ ЗАКРЫТИЯ ПОПАПА ПО КНОПКЕ КРЕСТИК
//*************************************************************************************************
closeButtons.forEach(function (button) {
  const popup = button.closest('.popup');
  button.addEventListener('click', () => closePopup(popup));
});
///////////////////////////////////////////////////////////////////////////////////////////////////

//*************************************************************************************************
//СЛУШАТЕЛЬ на кнопку Сабмит = ИЗМЕНЕНИЕ ПОВЕДЕНИЯ SUBMIT ФОРМЫ В ПОПАПЕ ПРОФАЙЛ
//*************************************************************************************************
formProfile.addEventListener('submit', handleFormSubmitProfile);
///////////////////////////////////////////////////////////////////////////////////////////////////

//*************************************************************************************************
//СЛУШАТЕЛЬ на кнопку Сабмит = ИЗМЕНЕНИЕ ПОВЕДЕНИЯ SUBMIT ФОРМЫ В ПОПАПЕ PLACE
//*************************************************************************************************
formPlace.addEventListener('submit', handleFormSubmitPlace);
///////////////////////////////////////////////////////////////////////////////////////////////////

enableValidation(Words);